# الدرس رقم واحد - امر الطباعة في بايثون

# امر الطباعة في بايثون من الأوامر المهمة والضرورية في هذه اللغة
# او لأي لغة برمجية اخرى
# سنقوم في هذا الدرس بالقيام بالطباعة في بايثون
# يليها فتح وإغلاق القوس print أمر الطباعة في بايثون ببساطة هو

print()

# كيف نقوم بتنفيذ هذا الأمر؟ هناك عدة خيرات لكنها سنذكر هنا خياران:
# python shell/console ١. يمكنك كتابة الأمر في
# في واجهة سطر الآوامر python3 وكتابة python shell وذلك من خلال الدخول على
# ٢. الخيار الثاني هو تنفيذ البرنامج ككل عبر كتابة الأمر
# في واجهة سطر الآوامر python3 lesson_1.py

# ستجد ان مخرج هذا الأمر هو سطر إضافي فارغ لأنه بشكل تلقائي سيقوم هذا الامر
# بطباعة سطر اضافي اذا لم يتم تزويد الأمر بأي محتوى لطباعتها


# دعنا نفوم بتزويد امر الطباعة برسالة نصية ليتم طباعتها
print("Hello, I am learning Python and I am loving it!")

# print يمكنك طباعة أي محتوى نصي ترغب فيه بواسطة امر
# سنقوم بالرجوع لامر الطباعه في الدروس القادمة

# إنتهى هذا الدرس
