# الدرس الثاني - المتغيرات في بايثون

# المتغيرات هي أشبه ماتكون بصناديق تحتوي بداخلها قيمة/قيم معينه.
# بعد تعيين المتغير يتم حجز موقع محدد في ذاكرة الكمبيوتر

# لنفترض انك ترغب بتخزين فيم مثل اسمك وعمرك. يمكنك القيام بذلك كما يلي
name = 'Mohammed'
age = 25

# هي اسماء لمتغيران وعلامة يساوي "=" ليست للمساواة ولاكنها للتعيين name و age
# name إلى متغير اسمه "Mohammed" فالمقصود بالكود أعلاه هو تعيين كلمة
# age كذلك نغس الطريقة تتم للمتغير
# لاحظ ان نوع البيانات التي تم تخزينها بين المتغيران مختلف
# (integer) فهي عدد  age اما المتغير (string) فالاولى هي سلسلة من الأحرف

# تستطيع كذلك تغيير القيمة لنفس المتغير الذي تم تعريفه
name = 'Abdullah'
age = 41

# 25 و Mohammed  و رقم 41 بدل من Abdullah تغيرت فأصبحت name و age  القييم في
# يمكنك التأكد من ذلك من خلال طباعة القييم للمتغيران كما يلي

print(name)
print(age)

# يمكنك كذلك تعريف اكثر من متغيير وتعيين قيم لهم في آن واحد
name, age, city = 'Ahmed', 39, 'Riyadh'

# يمكنك الآن طباعة قيم المتغيرات السابقة بإستخدام امر طباعة
print(name)
print(age)
print(city)

# إنتهى هذا الدرس
