# الدرس رقم واحد - امر الطباعة في بايثون

# امر الطباعة في بايثون من الأوامر المهمة والضرورية في هذه اللغة
# او لأي لغة برمجية اخرى
# سنقوم في هذا الدرس بالقيام بالطباعة في بايثون
# أمر الطباعة في بايثون ببساطة هو print يليها فتح وإغلاق القوس كالآتي

print()

# كيف نقوم بتنفيذ هذا الأمر؟ هناك عدة خيرات لكنها سنذكر هنا خياران:
# ١. يمكنك كتابة الأمر في python shell/console
# وذلك من خلال الدخول على python shell عبر كتابة python3 في واجهة سطر الآوامر
# ٢. الخيار الثاني هو تفيذ البرنامج ككل عبر كتابة الأمر
# python3 lesson_1.py في واجهة سطر الآوامر

# ستجد ان مخرج هذا الأمر هو سطر إضافي فارغ لأنه بشكل تلقائي سيقوم هذا الامر
# بطباعة سطر اضافي اذا لم يتم تزويد الأمر بأي محتوى لطباعتها


# دعنا نفوم بتزويد امر الطباعة برسالة نصية ليتم طباعتها
print("Hello, I am learning Python and I am loving it!")

# يمكنك طباعة أي محتوى نصي ترغب فيه بواسطة امر print
# سنقوم بالرجوع لامر الطباعه في الدروس القادمة

# إنتهى هذا الدرس
