# الدرس رقم صفر - التعليقات في بايثون

# أهلاً بك في اول درس في لغة بايثون باللغة العربية
# يمكنك كتابة تعليق (comment) من خلال اضافة علامة المربع "#" (hashtag)
# كما هو موضح في هذا السطر أوالأسطر التي تسبقها
# من المهم معرفة ان التعليقات لا تعد جزء من الأكواد البرمجية في بايثون وبالتالي
# سيقوم مترجم بايثون وهو الذي يقوم بفراءة وتنفيذ البرنامج بتجاهلها
# اخيرا, لاحظ ان هذا الملف يعتبر برنامج او سكريبت في بايثون
# لان الملف ينتهي بصيغة py اختصار من Python لكنه يفتقر تمام من الأكواد البرمجية

# إنتهى هذا الدرس
