# الدرس الثاني - المتغيرات في بايثون

# المتغيرات هي أشبه ماتكون بصناديق تحتوي بداخلها قيمة/قيم معينه.
# بعد تعيين المتغير يتم حجز موقع محدد في ذاكرة الكمبيوتر

# لنفترض انك ترغب بتخزين فيم مثل اسمك وعمرك. يمكنك القيام بذلك كما يلي
name = 'Mohammed'
age = 25

# name و age هي اسماء لمتغيران وعلامة يساوي "=" ليست للمساواة ولاكنها للتعيين
# فالمقصود بالكود أعلاه هي تعيين كلمة "Mohammed" إلى متغير اسمه name
#  كذلك نغس الطريقة تتم للمتغير age
# لاحظ ان نوع البيانات التي تم تخزينها بين المتغيران مختلف
# فالاولى سلسلة من الأحرف (string) اما المتغير age فهي عدد (integer)

# تستطيع كذلك تغيير القيمة لنفس المتغير الذي تم تعريفه
name = 'Abdullah'
age = 41

# القييم في name و age تغيرت فأصبحت Abdullah و رقم 41 بدل من Mohammed و 25
# يمكنك التأكد من ذلك من خلال طباعة القييم للمتغيران كما يلي

print(name)
print(age)

# يمكنك كذلك تعريف اكثر من متغيير وتعيين قيم لهم في آن واحد
name, age, city = 'Ahmed', 39, 'Riyadh'

# يمكنك الآن طباعة قيم المتغيرات السابقة بإستخدام امر طباعة
print(name)
print(age)
print(city)

# إنتهى هذا الدرس
