# الدرس رقم صفر - التعليقات في بايثون

# أهلاً بك في اول درس في لغة بايثون باللغة العربية
# "#" (hashtag) من خلال اضافة علامة المربع (comment) يمكنك كتابة تعليق
# كما هو موضح في هذا السطر أوالأسطر التي تسبقها
# من المهم معرفة ان التعليقات لا تعد جزء من الأكواد البرمجية في بايثون وبالتالي
# سيقوم مترجم بايثون وهو الذي يقوم بفراءة وتنفيذ البرنامج بتجاهلها
# اخيرا, لاحظ ان هذا الملف يعتبر برنامج او سكريبت في بايثون
# لكنه يفتقر تمام من الأكواد البرمجية Python اختصار من py لان الملف ينتهي بصيغة
# إنتهى هذا الدرس
